import random #외장함수 불러오기



while True:
    while True:
        try:
            minenum = int(input('지뢰 개수(0~225):'))
            if 0 <= minenum <= 225:
                break
            else:
                print("0에서 225 사이의 숫자를 입력해주세요.")
        except ValueError:
            print("유효한 숫자를 입력해주세요.")


    Map=[['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0'],
     ['0','0','0','0','0','0','0','0','0','0','0','0','0','0','0']]
     
    #기본 GUI 생성
    i=minenum
    while i: #지뢰 설정
        a=random.randint(0,14)
        b=random.randint(0,14)
        if Map[a][b]=='♪': continue
        else: i-=1
        Map[a][b]='♪'
        for x in range(-1,2):
            for y in range(-1,2):
                f=a+x
                g=b+y
                if x==0 and y==0: continue
                elif f==-1 or f==15 or g==-1 or g==15: continue
                elif Map[f][g]=='♪': continue
                else: Map[f][g]=str(int(Map[f][g])+1)
               
    num={'0':'　','1':'⑴','2':'⑵','3':'⑶','4':'⑷','5':'⑸','6':'⑹','7':'⑺','8':'⑻'}
    unnum={a:int(b) for b,a in num.items()}
    for A in range(15):#숫자(문자열)를 다른 문자로 대체
        for B in range(15):
            for i in num:
                if Map[A][B]==i:
                    Map[A][B]=num[i]

    GUI=[['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□'],
         ['□','□','□','□','□','□','□','□','□','□','□','□','□','□','□']]
    #게임화면에 보일 GUI 생성

    count=225
    bomb=False
    warning=False
    Val=False
    flag=minenum
    s1 = -1
    s2 = -1
    exc = []
    #초반설정

    def click(x,y):
        global count,warning,bomb
        if GUI[x][y] in ['　','⑴','⑵','⑶','⑷','⑸','⑹','⑺','⑻']: 
            warning=True  

        elif Map[x][y]=='♪':
            GUI[x][y]='♪'
            bomb=True
        else:
            GUI[x][y]=Map[x][y]
            count-=1
            if GUI[x][y]=='　':
                for i in range(-1,2):
                    for j in range(-1,2):
                        if i==0 and j==0: continue
                        if 0<=x+i<=14 and 0<=y+j<=14: 
                            click(x+i,y+j)
                            warning=False
    

    while 1:
        print('\n'*27+'지뢰찾기 게임(지뢰%d개)\n\n'%minenum+'■'*18) 
        print('■⑮'+GUI[0][14]+GUI[1][14]+GUI[2][14]+GUI[3][14]+GUI[4][14]+GUI[5][14]+GUI[6][14]+GUI[7][14]+GUI[8][14]+GUI[9][14]+GUI[10][14]+GUI[11][14]+GUI[12][14]+GUI[13][14]+GUI[14][14]+'■')
        print('■⑭'+GUI[0][13]+GUI[1][13]+GUI[2][13]+GUI[3][13]+GUI[4][13]+GUI[5][13]+GUI[6][13]+GUI[7][13]+GUI[8][13]+GUI[9][13]+GUI[10][13]+GUI[11][13]+GUI[12][13]+GUI[13][13]+GUI[14][13]+'■')
        print('■⑬'+GUI[0][12]+GUI[1][12]+GUI[2][12]+GUI[3][12]+GUI[4][12]+GUI[5][12]+GUI[6][12]+GUI[7][12]+GUI[8][12]+GUI[9][12]+GUI[10][12]+GUI[11][12]+GUI[12][12]+GUI[13][12]+GUI[14][12]+'■')
        print('■⑫'+GUI[0][11]+GUI[1][11]+GUI[2][11]+GUI[3][11]+GUI[4][11]+GUI[5][11]+GUI[6][11]+GUI[7][11]+GUI[8][11]+GUI[9][11]+GUI[10][11]+GUI[11][11]+GUI[12][11]+GUI[13][11]+GUI[14][11]+'■')
        print('■⑪'+GUI[0][10]+GUI[1][10]+GUI[2][10]+GUI[3][10]+GUI[4][10]+GUI[5][10]+GUI[6][10]+GUI[7][10]+GUI[8][10]+GUI[9][10]+GUI[10][10]+GUI[11][10]+GUI[12][10]+GUI[13][10]+GUI[14][10]+'■')
        print('■⑩'+GUI[0][9]+GUI[1][9]+GUI[2][9]+GUI[3][9]+GUI[4][9]+GUI[5][9]+GUI[6][9]+GUI[7][9]+GUI[8][9]+GUI[9][9]+GUI[10][9]+GUI[11][9]+GUI[12][9]+GUI[13][9]+GUI[14][9]+'■')
        print('■⑨'+GUI[0][8]+GUI[1][8]+GUI[2][8]+GUI[3][8]+GUI[4][8]+GUI[5][8]+GUI[6][8]+GUI[7][8]+GUI[8][8]+GUI[9][8]+GUI[10][8]+GUI[11][8]+GUI[12][8]+GUI[13][8]+GUI[14][8]+'■')
        print('■⑧'+GUI[0][7]+GUI[1][7]+GUI[2][7]+GUI[3][7]+GUI[4][7]+GUI[5][7]+GUI[6][7]+GUI[7][7]+GUI[8][7]+GUI[9][7]+GUI[10][7]+GUI[11][7]+GUI[12][7]+GUI[13][7]+GUI[14][7]+'■')
        print('■⑦'+GUI[0][6]+GUI[1][6]+GUI[2][6]+GUI[3][6]+GUI[4][6]+GUI[5][6]+GUI[6][6]+GUI[7][6]+GUI[8][6]+GUI[9][6]+GUI[10][6]+GUI[11][6]+GUI[12][6]+GUI[13][6]+GUI[14][6]+'■')
        print('↑⑥'+GUI[0][5]+GUI[1][5]+GUI[2][5]+GUI[3][5]+GUI[4][5]+GUI[5][5]+GUI[6][5]+GUI[7][5]+GUI[8][5]+GUI[9][5]+GUI[10][5]+GUI[11][5]+GUI[12][5]+GUI[13][5]+GUI[14][5]+'■')
        print('y⑤'+GUI[0][4]+GUI[1][4]+GUI[2][4]+GUI[3][4]+GUI[4][4]+GUI[5][4]+GUI[6][4]+GUI[7][4]+GUI[8][4]+GUI[9][4]+GUI[10][4]+GUI[11][4]+GUI[12][4]+GUI[13][4]+GUI[14][4]+'■')
        print('■④'+GUI[0][3]+GUI[1][3]+GUI[2][3]+GUI[3][3]+GUI[4][3]+GUI[5][3]+GUI[6][3]+GUI[7][3]+GUI[8][3]+GUI[9][3]+GUI[10][3]+GUI[11][3]+GUI[12][3]+GUI[13][3]+GUI[14][3]+'■')
        print('■③'+GUI[0][2]+GUI[1][2]+GUI[2][2]+GUI[3][2]+GUI[4][2]+GUI[5][2]+GUI[6][2]+GUI[7][2]+GUI[8][2]+GUI[9][2]+GUI[10][2]+GUI[11][2]+GUI[12][2]+GUI[13][2]+GUI[14][2]+'■')
        print('■②'+GUI[0][1]+GUI[1][1]+GUI[2][1]+GUI[3][1]+GUI[4][1]+GUI[5][1]+GUI[6][1]+GUI[7][1]+GUI[8][1]+GUI[9][1]+GUI[10][1]+GUI[11][1]+GUI[12][1]+GUI[13][1]+GUI[14][1]+'■')
        print('■①'+GUI[0][0]+GUI[1][0]+GUI[2][0]+GUI[3][0]+GUI[4][0]+GUI[5][0]+GUI[6][0]+GUI[7][0]+GUI[8][0]+GUI[9][0]+GUI[10][0]+GUI[11][0]+GUI[12][0]+GUI[13][0]+GUI[14][0]+'■')
        print('■※①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮■\n'+'■'*14+'x→■■\n')

        print('남은 지뢰 수: ',flag)
        
        if count==minenum or not flag:
            print('모든 지뢰를 찾았습니다!\n')
            break

        elif bomb:
            print('지뢰를 눌렀습니다...\nGame Over')
            break

        elif warning:
            warning=False
            print('이미 확인한 좌표입니다.\n')
        elif Val:
            Val=False
            print('좌표는 1에서 15사이의 숫자여야 하고, 명령은 0 ~ 2의 숫자여야 합니다.')
        else:
            print('\n') #경우의 수
            
        print('')
        
        
        try:
            if not (0<=s1<=14):
                s1=int(input('x좌표를 입력하세요: '))-1
            else:
                print('x좌표: ',s1+1)
            if not (0<=s1<=14):
                Val = True
                continue
            if not (0<=s2<=14):
                s2=int(input('y좌표를 입력하세요: '))-1
            else:
                print('y좌표: ',s2+1)
            if not (0<=s2<=14):
                Val = True
                continue
            s3=int(input('명령을 입력하세요(0은 열기, 1은 깃발(¶), 2는 화음): '))
        except:
            Val=True
            continue
        if not (0<=s1<=14 and 0<=s2<=14):
            Val=True
            continue

        if not s3:
            click(s1,s2)
            s1 = -1
            s2 = -1
        elif s3==1:
            GUI[s1][s2]='¶'
            s1 = -1
            s2 = -1
        else:
            cntflg=0
            for i in range(-1,2):
                for j in range(-1,2):
                    if i==0 and j==0: continue
                    elif 0<=s1+i<=14 and 0<=s2+j<=14 and GUI[s1+i][s2+j]=='¶':
                        cntflg+=1
            if cntflg==unnum[Map[s1][s2]]: #깃발 수와 그 칸의 숫자가 같으면 
                for i in range(-1,2):
                    for j in range(-1,2):
                        if (i==0 and j==0) or not (0<=s1+i<=14 and 0<=s2+j<=14) or GUI[s1+i][s2+j]=='¶': continue
                        elif 0<=s1+i<=14 and 0<=s2+j<=14: 
                            click(s1+i,s2+j)
                            warning=False
            s1 = -1
            s2 = -1 
        
        for i in range(15):
            for j in range(15):
                
                if GUI[i][j]=='¶' and Map[i][j]=='♪':
                    flagcheck = 0
                    for e in exc:
                        if (i, j) == e:
                            flagcheck = 1
                            break
                    if flagcheck:
                        continue
                    flag-=1
                    exc.append((i, j))#중복방지

    
        if count==minenum or bomb:
            for i in range(15):
                for j in range(15):
                    if Map[i][j]=='♪' and GUI[i][j]!='¶':
                        GUI[i][j]='♪'

    if input("더 하신다면 'r'을, 그만두시겠다면 아무거나 입력해주세요. : ")!='r':
        break
